Tekla Open API Reference for Tekla Structures 2025
LinkBase.Text Property
 Gets or sets the link text that is visible on the screen.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Text { get; set; }
Public Property Text As String
	Get
	Set
Property Value
Type: String
See Also
Reference
LinkBase Class
Tekla.Structures.Drawing Namespace